<?php

use Illuminate\Support\Str;

return [
    /*
    |--------------------------------------------------------------------------
    | Строка подключения YDB
    |--------------------------------------------------------------------------
    |
    | Пример:
    | grpcs://ydb.serverless.yandexcloud.net:2135/?database=/ru-central1/.../...
    |
    */
    'connection_string' => env('YDB_CONNECTION_STRING'),

    /*
    |--------------------------------------------------------------------------
    | Путь к ключу сервисного аккаунта
    |--------------------------------------------------------------------------
    */
    'credentials_file' => env('YDB_SERVICE_ACCOUNT_KEY_FILE_CREDENTIALS'),

    /*
    |--------------------------------------------------------------------------
    | Пул сессий
    |--------------------------------------------------------------------------
    |
    | Настройка числа сессий и таймаутов для клиента таблиц.
    |
    */
    'session' => [
        'max_sessions' => env('YDB_MAX_SESSIONS', 10),
        'connect_timeout' => env('YDB_CONNECT_TIMEOUT', 10),
        'request_timeout' => env('YDB_REQUEST_TIMEOUT', 30),
    ],
];

